Revit 2026 API

# EnergyDataSettingsCoreOffset Property

---

The default offset used to determine the outer perimeter to be divided into zones.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CoreOffset { get; set; }
```
```vb
Public Property CoreOffset As Double
	Get
	Set
```
```cpp
public:
property double CoreOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member CoreOffset : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for coreOffset must be between 0 and 30000 feet. |

A Zone can be either a Mass Zone or an Analytical Space depending on whether the AnalysisType is ConceptualMasses or otherwise. Specifying a value here determines the zone depth and creates a core zone.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace